# Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов
# класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы
# складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:

    def __init__(self, m_list):
        self.m_list = m_list

    def __str__(self):
        return str('\n'.join([' '.join([str(el) for el in i]) for i in self.m_list]))

    def __add__(self, other):
        for i in range(len(self.m_list)):
            for j in range(len(self.m_list[i])):
                self.m_list[i][j] = self.m_list[i][j] + other.m_list[i][j]
        return Matrix.__str__(self)


matr1 = Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
matr2 = Matrix([[9, 8, 7], [6, 5, 4], [3, 2, 1]])
print(matr1.__add__(matr2))
